tutorials/multiphase/vof/vofSolver/laminar/waves/waveFlume/constant/postProcessingProperties
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      postProcessingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

deleteParentOutputDirectory false;

regularSpectrum
{
    callName surfaceElevation;

    removeDuplicate true;
    inputDir surfaceElevation/0.0011976;

    deltaT 0.01;
    tMin    10.0; // Default: minimum time
    //tMax    11.0; // Default: maximum time

    // The action list is a set of processes on the data
    actionList ( interpolateSurfaceElevation powerSpectraLS write2Ascii removeData );

    nFreq 4;
    period 2.0;
    allDataSets true;
}

// ************************************************************************* //
