tutorials/multiphase/vof/vofSolver/laminar/waves/waveFlume/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha1.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 2;
        dynamicCompressionModel none;
        cAlpha          2.0;
        icAlpha         0;

        MULESCorr       no;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    "pcorr.*"
    {
        solver                   GAMG;
        smoother                 SSGS;
        nPreSweeps                  0;
        nPostSweeps                 2;
        nFinestSweeps               2;
        cacheAgglomeration       true;
        nCellsInCoarsestLevel      10;
        agglomerator     faceAreaPair;
        mergeLevels                 1;

        tolerance                1e-7;
        relTol                    0.0;
    };

    p_rgh
    {
        solver GAMG;
        smoother         SSGS;;
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;

        tolerance        1e-7;
        relTol           0.0;
    };

    p_rghFinal
    {
        solver GAMG;
        smoother         SSGS
        nPreSweeps       0;
        nPostSweeps      2;
        nFinestSweeps    2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;

        tolerance        1e-7;
        relTol           0.0;
    };

    U 
    {
        solver       PBiCGStab;
        preconditioner    USGS;
        tolerance        1e-06;
        relTol               0;
    };

    UFinal
    {
        solver       PBiCGStab; 
        preconditioner    USGS;
        tolerance        1e-06;
        relTol               0;
    };
}


PIMPLE 
{ 
    pdRefCell 0;
    pdRefValue 0;
    momentumPredictor yes;
    nOuterCorrectors 1; 
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
}


// ************************************************************************* //
